package com.flyingosred.app.android.simpleperpetualcalendar.data.database;

public class SolarTermDatabase {

    public static final String TIMEZONE = "GMT+8";

    public static final int START_YEAR = 2016;

    public static final int END_YEAR = 2016;

    public static final int[][][] DATABASE = {
            // 数据来源自紫金山天文台节气数据
            // 所载节气时刻系东经120°标准时（北京时间 GMT+8）
            // 由于算法一样，其他地区比如台湾的数据和紫金山天文台数据一致
            // 格式 [月, 日, 小时, 分钟]
            // 必须从小寒开, 按照顺序排列
            {
                    // 小寒          // 大寒         // 立春        // 雨水          // 惊蛰          // 春分        // 清明         // 谷雨            // 立夏         // 小满            // 芒种        // 夏至           // 小暑        // 大暑         // 立秋         // 处暑           // 白露           // 秋分         // 寒露         // 霜降           // 立冬         // 小雪           // 大雪          // 冬至
    /* 2016 年 */ {1, 6, 6, 8}, {1, 20, 23, 27}, {2, 4, 17, 46}, {2, 19, 13, 34}, {3, 5, 11, 44}, {3, 20, 12, 30}, {4, 4, 16, 28}, {4, 19, 23, 29}, {5, 5, 9, 42}, {5, 20, 22, 36}, {6, 5, 13, 49}, {6, 21, 6, 34}, {7, 7, 0, 3}, {7, 22, 17, 30}, {8, 7, 9, 53}, {8, 23, 0, 38}, {9, 7, 12, 51}, {9, 22, 22, 21}, {10, 8, 4, 33}, {10, 23, 7, 46}, {11, 7, 7, 48}, {11, 22, 5, 22}, {12, 7, 0, 41}, {12, 21, 18, 44}
            }
    };
}
